In [66]:
from pandas import Series
import pandas as pd
import numpy as np
import seaborn as sns

In [70]:
df = pd.read_csv("titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [43]:
df = sns.load_dataset("titanic")

In [44]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [72]:
#각 컬럼별 NaN의 갯수
df.Age.isnull().sum()

177

In [73]:
len(df.index)

891

In [74]:
#NaN이 2개 이상인것은 무조건 삭제
colLen=len(df.columns) # 컬럼의 갯수
dropRow=df.dropna(thresh=colLen-2)
len(dropRow.index)

891

In [75]:
#fare의 경우 평균값으로 채우기
df["Fare"].fillna(df["Fare"].mean(), inplace=True)

In [76]:
#age는 중앙값으로 채우기
df["Age"].fillna(df["Age"].median(), inplace=True)

In [77]:
#그 외는 최빈값으로 채우기
colList=list(df.columns)
f=lambda x: df[x].mode()[0]
modeList=list(map(f,list(df.columns)))
modeList

[1,
 0,
 3,
 'Abbing, Mr. Anthony',
 'male',
 28.0,
 0,
 0,
 '1601',
 8.05,
 'B96 B98',
 'S']

In [78]:
i=0

for modeVal in modeList:
    colName =colList[i]
    df[colName].fillna(modeVal, inplace=True)
    i+=1
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B96 B98,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,B96 B98,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,B96 B98,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,B96 B98,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,B96 B98,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,B96 B98,Q

In [79]:
#승선자의 평균 나이를 구하세요 
df["Age"].mean()

29.36158249158249

In [88]:
#클래스별  승선인원
df["Pclass"].unique() #[Third, First, Second]

df["cls_f"]=df["Pclass"]==1
df.cls_f.replace({False:0,True:1}, inplace=True)
df[["Pclass","cls_f"]]

df.cls_f.sum()

216

In [127]:
temp=[]
clsNumList=[]#[Third, First, Second]
ca=df["Pclass"].unique()
#ca[0]
for cls in ca:
    print(cls)
    df.cls_n=df["Pclass"]==cls
    df.cls_n.replace({False:0,True:1}, inplace=True)
    temp.append(df.cls_n.sum())
    
# clsNumList.sort(reverse=True)
# print("first, second, Third  순서")
clsNumList.append(temp[1])
clsNumList.append(temp[2])
clsNumList.append(temp[0])
clsNumList# 총 승선한 클래스 인원 리스트 (first, second, third)

3
1
2

[216, 184, 491]

In [92]:
#클래스별 생존자의 수를 구하세요(5점) 
df.groupby("Pclass")["Age"].count()

Pclass
1    216
2    184
3    491
Name: Age, dtype: int64

In [93]:
cls_gr=df.groupby("Pclass")["Age"].count()
cls_gr.index

Int64Index([1, 2, 3], dtype='int64', name='Pclass')

In [98]:
cls_gr.index[0]

1

In [111]:
cls_gr

Pclass
1    216
2    184
3    491
Name: Age, dtype: int64

In [117]:
#클래스별 승선인원을 구하세요 
for i in range(len(cls_gr.index)):
    print(cls_gr.index[i],cls_gr[i+1])

1 216
2 184
3 491

In [119]:
df.groupby("Pclass")["Survived"]

In [120]:
surClsNumList=df.groupby("Pclass")["Survived"].sum()
surClsNumList

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [123]:
len(surClsNumList.index)

3

In [124]:
surClsNumList

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [130]:
#클래스별 생존율을 구하세요
perList=[]
for i in range(len(surClsNumList.index)):
    print(i)
    perList.append(round(surClsNumList[i+1]/clsNumList[i],2))
perList

    
# 총 승선한 클래스 인원 리스트 (first, second, third)

0
1
2

[0.63, 0.47, 0.24]

In [131]:
#생존자중 남성과 여성의 비율을 구하세요 (10점)
surList=[]
surSeries = df.groupby("Sex")["Survived"].count()

#total = surSeries [0]+surSeries[1]#0 female, 1 male
total = surSeries.sum()
femaleNum=surSeries [0]
maleNum=surSeries [1]

for cn in surSeries:
    surList.append(round(cn/total,2))

surList

[0.35, 0.65]

In [133]:
#생존자의 비율중 남자, 여자, 아이의 비율을 구하세요 (20점)
whoList = []
whoSeries = df.groupby("Sex")["Survived"].count()

whoTotal =whoSeries.sum()

childNum=whoSeries [0]
manNum=whoSeries [1]
woman=whoSeries [2]

for cn in whoSeries:
    whoList.append(round(cn/whoTotal,2))
print("child","man","woman")
whoList

IndexError: index out of bounds

In [65]:
#생존자의 평균 나이를 구하세요 (5점)
surAgeSum=df.groupby("survived")["age"].sum()
# print(surAgeSum)
surAgeCount=df.groupby("survived")["age"].count()

# print(surAgeCount)

surAvgAge=round(surAgeSum[1]/surAgeCount[1],2)
print(surAvgAge)

28.29